HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5s_bf.h
/** \\brief  Length for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5S_FDRT_Bits.STEP */
#define IFX_PSI5S_FDRT_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_LEN (11)

/** \\brief  Mask for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_MSK (0x7ff)

/** \\brief  Offset for Ifx_PSI5S_FDV_Bits.FD_VALUE */
#define IFX_PSI5S_FDV_FD_VALUE_OFF (0)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ASC */
#define IFX_PSI5S_GCR_ASC_OFF (31)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN0 */
#define IFX_PSI5S_GCR_CEN0_OFF (16)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN1 */
#define IFX_PSI5S_GCR_CEN1_OFF (17)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN2 */
#define IFX_PSI5S_GCR_CEN2_OFF (18)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN3 */
#define IFX_PSI5S_GCR_CEN3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN3 */
#define IFX_PSI5S_GCR_CEN3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN3 */
#define IFX_PSI5S_GCR_CEN3_OFF (19)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN4 */
#define IFX_PSI5S_GCR_CEN4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN4 */
#define IFX_PSI5S_GCR_CEN4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN4 */
#define IFX_PSI5S_GCR_CEN4_OFF (20)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN5 */
#define IFX_PSI5S_GCR_CEN5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN5 */
#define IFX_PSI5S_GCR_CEN5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN5 */
#define IFX_PSI5S_GCR_CEN5_OFF (21)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN6 */
#define IFX_PSI5S_GCR_CEN6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN6 */
#define IFX_PSI5S_GCR_CEN6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN6 */
#define IFX_PSI5S_GCR_CEN6_OFF (22)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CEN7 */
#define IFX_PSI5S_GCR_CEN7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CEN7 */
#define IFX_PSI5S_GCR_CEN7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CEN7 */
#define IFX_PSI5S_GCR_CEN7_OFF (23)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.CRCI */
#define IFX_PSI5S_GCR_CRCI_OFF (0)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC0 */
#define IFX_PSI5S_GCR_ETC0_OFF (8)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC1 */
#define IFX_PSI5S_GCR_ETC1_OFF (9)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC2 */
#define IFX_PSI5S_GCR_ETC2_OFF (10)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC3 */
#define IFX_PSI5S_GCR_ETC3_OFF (11)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC4 */
#define IFX_PSI5S_GCR_ETC4_OFF (12)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC5 */
#define IFX_PSI5S_GCR_ETC5_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC5 */
#define IFX_PSI5S_GCR_ETC5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC5 */
#define IFX_PSI5S_GCR_ETC5_OFF (13)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC6 */
#define IFX_PSI5S_GCR_ETC6_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC6 */
#define IFX_PSI5S_GCR_ETC6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC6 */
#define IFX_PSI5S_GCR_ETC6_OFF (14)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.ETC7 */
#define IFX_PSI5S_GCR_ETC7_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.ETC7 */
#define IFX_PSI5S_GCR_ETC7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.ETC7 */
#define IFX_PSI5S_GCR_ETC7_OFF (15)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.FE */
#define IFX_PSI5S_GCR_FE_OFF (4)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.HDI */
#define IFX_PSI5S_GCR_HDI_OFF (7)

/** \\brief  Length for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_LEN (4)

/** \\brief  Mask for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5S_GCR_Bits.IDT */
#define IFX_PSI5S_GCR_IDT_OFF (24)

